KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
<?xml version='1.0' encoding='UTF-8'?>
<!--
Copyright (c) 2024 STMicroelectronics.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>STM32WL33</name>
  <version>1.0</version>
  <description>STM32WL33</description>
  <cpu>
    <name>CM0+</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>0x20</size>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>ADC address block description</description>
      <groupName>ADC</groupName>
      <baseAddress>0x41006000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x68</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <description>ADC interrupt</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>VERSION_ID</name>
          <displayName>VERSION_ID</displayName>
          <description>VERSION_ID register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x21</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VERSION_ID</name>
              <description>VERSION_ID[7:0]: version of the embedded IP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <displayName>CONF</displayName>
          <description>CONF register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x20002</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>CONT</name>
              <description>CONT: regular sequence runs continuously when ADC mode is enabled:

0: enable the single conversion: when the sequence is over, the conversion stops

1: enable the continuous conversion: when the sequence is over, the sequence starts again

until the software sets the CTRL.STOP_OP_MODE bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQUENCE</name>
              <description>SEQUENCE: enable the sequence mode (active by default):

0: sequence mode is disabled, only SEQ0 is selected

1: sequence mode is enabled, conversions from SEQ0 to SEQx with x=SEQ_LEN

Note: clearing this bit is equivalent to SEQUENCE=1 and SEQ_LEN=0000. Ideally, this bit can

be kept high as redundant with keeping high and setting SEQ_LEN=0000.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LEN</name>
              <description>SEQ_LEN[3:0]: number of conversions in a regular sequence:

0000: 1 conversion, starting from SEQ0

0001: 2 conversions, starting from SEQ0

...

1111: 16 conversions, starting from SEQ0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_SYNCHRO_ENA</name>
              <description>SMPS_SYNCHRO_ENA: synchronize the ADC start conversion with a pulse generated by the

SMPS:

0: SMPS synchronization is disabled for all ADC clock frequencies

1: SMPS synchronization is enabled (only when ADC clock is 8 MHz or 16 MHz)

Note: SMPS_SYNCHRO_ENA must be 0 when the ADC analog clock is 32 MHz or when

PWRC_CR5.NOSMPS = 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_RATE_LSB</name>
              <description>SAMPLE_RATE_LSB: Sample Rate LSB

This field is an extension of SAMPLE_RATE definition in bits 12,11 of CONF register. It

impacts the conversion rate of ADC (F_ADC). See SAMPLE_RATE bits for the full description.

When this field is set to a value different than 0, SMPS synchronization is not feasible.

This value is hidden to the user</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_RATE</name>
              <description>SAMPLE_RATE[1:0]: conversion rate of ADC (F_ADC):

F_ADC = F_ADC_CLK/(16 + 16*SAMPLE_RATE_MSB + 4*SAMPLE_RATE + SAMPLE_RATE_LSB),where

F_ADC_CLK is the analog ADC clock frequency. By default F_ADC_CLK is 16MHz frequency.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_DS_ENA</name>
              <description>DMA_DS_EN: enable the DMA mode for the Down Sampler data path:

0: DMA mode is disabled

