KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
power/speed of the Comparator.

00:High speed

01 or 10:Medium speed

11:Ultra low power</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INMSEL</name>
              <description>INMSEL: Comparator input minus selection bits

These bits are set and cleared by software (only if LOCK not set). They select which input is

connected to the input minus of comparator.

000: 1/4 VREFINT

001: 1/2 VREFINT

010: 3/4VREFINT

011: VREFINT

100: DAC OUT

101: PA13

110: PB0

111: PB3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPSEL</name>
              <description>INPSEL[1:0]: Comparator input plus selection bit

This bit is set and cleared by software (only if LOCK not set).

00: PA14

01: PB1

1x: PB2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLARITY</name>
              <description>POLARITY: Comparator polarity selection bit

This bit is set and cleared by software (only if LOCK not set). It inverts Comparator polarity.

0: Comparator output value not inverted

1: Comparator output value inverted</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYST</name>
              <description>HYST[1:0]: Comparator hysteresis selection bits

These bits are set and cleared by software (only if LOCK not set). They select the

Hysteresis voltage of the comparator .

00: No hysteresis

01: Low hysteresis

10: Medium hysteresis

11: High hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKING</name>
              <description>BLANKING[2:0]: Comparator blanking source selection bits

These bits select which timer output controls the comparator output blanking.

000: No blanking

001: TIM2 OC4 selected as blanking source

010: TIM16 OC1 selected as blanking source

All other values: reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRGEN</name>
              <description>BRGEN: Scaler bridge enable

This bit is set and cleared by software (only if LOCK not set). This bit enable the bridge of

the scaler.

0: Scaler resistor bridge disable

1: Scaler resistor bridge enable

If SCALEN is set and BRGEN is reset, BG voltage reference is available                                                                                                      but not 1/4BGAP, 1/2BGAP, 3/4 BGAP. BGAP value is sent instead of 1/4BGAP, 1/2BGAP, 3/4 BGAP.

If SCALEN and BRGEN are set, 1/4 BGAP 1/2BGAP 3/4BGAP and BGAP voltage

references are available.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCALEN</name>
              <description>SCALEN: Voltage scaler enable bit

This bit is set and cleared by software. This bit enable the outputs of the VREFINT divider

available on the minus input of the Comparator

0: scaler disable

1: scaler enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>VALUE: Comparator output status bit

This bit is read-only. It reflects the current comparator output taking into account POLARITY

bit effect.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>LOCK: COMP_CSR register lock bit

This bit is set by software and cleared by a hardware system reset. It locks the whole

content of the comparator control register, COMP1_CSR[31:0].

0: COMP1_CSR[31:0] are read/write

1: COMP1_CSR[31:0] are read-only</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <description>DAC address block description</description>
      <groupName>DAC</groupName>
      <baseAddress>0x40006000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DAC</name>
        <description>DAC interrupt</description>
        <value>25</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>CR register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>EN: DAC channel enable This bit is set and cleared by software to enable/disable DAC

channel.

0: DAC channel disabled

1: DAC channel enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BON</name>
              <description>BON: DAC channel output buffer enable. This bit is set and cleared by software to

enable/disable DAC channel output buffer.

0: DAC channel output buffer disabled

1: DAC channel output buffer enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEN</name>
              <description>TEN: DAC channel trigger enable This bit is set and cleared by software to enable/disable

DAC channel trigger.

0: DAC channel trigger disabled and data written into the DAC_DHR register are transferred

