KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
       one APB0 clock cycle later to the DAC_DOR register

1: DAC channel trigger enabled and data from the DAC_DHR register are transferred three

       APB0 clock cycles later to the DAC_DOR register

Note: When software trigger is selected, the transfer from the DAC_DHR

register to the DAC_DOR register takes only one APB0 clock cycle.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEL</name>
              <description>TSEL[2:0]: DAC channel trigger selection These bits select the external event used to trigger

DAC channel.

000: Timer 16 TRGO event

001: PA8 pin event from SYSCFG

010 to 011: Reserved

111: Software trigger

Only used if bit TEN = 1 (DAC channel trigger enabled).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE</name>
              <description>WAVE[1:0]: DAC channel noise/triangle wave generation enable These bits are set and

cleared by software.

00: wave generation disabled

01: Noise wave generation enabled

1x: Triangle wave generation enabled

Note: Only used if bit TEN = 1 (DAC channel trigger enabled).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAMP</name>
              <description>MAMP[3:0]: DAC channel mask amplitude selector These bits are written by software to

select mask in wave generation mode or amplitude in triangle generation mode.

0000: Unmask bit0 of LFSR  triangle amplitude equal to 1

0001: Unmask bits[1:0] of LFSR  triangle amplitude equal to 3

0010: Unmask bits[2:0] of LFSR  triangle amplitude equal to 7

0011: Unmask bits[3:0] of LFSR  triangle amplitude equal to 15

0100: Unmask bits[4:0] of LFSR  triangle amplitude equal to 31

greater than or equal to 0101: Unmask bits[5:0] of LFSR  triangle amplitude equal to 63</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMAEN: DAC channel DMA enable This bit is set and cleared by software.

0: DAC channel DMA mode disabled

1: DAC channel DMA mode enabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAUDRIE</name>
              <description>DMAUDRIE: DAC channel DMA Underrun Interrupt enable This bit is set and cleared by

software.

0: DAC channel DMA Underrun Interrupt disabled

1: DAC channel DMA Underrun Interrupt enabled</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPEN</name>
              <description>CMPEN: DAC channel output to COMP INMINUS enable. This bit is set and cleared by

software.

0: DAC channel output to COMP INMINUS disabled

1: DAC channel output to COMP INMINUS enabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCMEN</name>
              <description>VCMEN: DAC channel output to VCM BUFFER enable. This bit is set and cleared by

software.

0: DAC channel output to VCM BUFFER disabled

1: DAC channel output to VCM BUFFER enabled</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCMON</name>
              <description>VCMON: VCMBUFF power-up. This bit is set and cleared by software.

0: VCM BUFFER OFF

1: VCM BUFFER ON</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIGR</name>
          <displayName>SWTRIGR</displayName>
          <description>SWTRIGR register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SWTRIG</name>
              <description>SWTRIG: DAC channel software trigger This bit is set by software to enable/disable the

software trigger.

0: Software trigger disabled

1: Software trigger enabled

Note: This bit is cleared by hardware (one APB0 clock cycle later) once the

DAC_DHR register value has been loaded into the DAC_DOR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR</name>
          <displayName>DHR</displayName>
          <description>DHR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DACDHR</name>
              <description>DACDHR[5:0]: DAC channel 6-bit data These bits are written by software which

specifies 6-bit data for DAC channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR</name>
          <displayName>DOR</displayName>
          <description>DOR register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DACDOR</name>
              <description>DACDOR[5:0]: DAC channel data output These bits are read-only, they contain data output

