KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
for DAC channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>SR register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAUDR</name>
              <description>DMAUDR: DAC channel DMA underrun flag This bit is set by hardware and cleared by

software (by writing it to 1).

0: No DMA underrun error condition occurred for DAC channel

1: DMA underrun error condition occurred for DAC channel (the currently selected trigger is

       driving DAC channel conversion at a frequency higher than the DMA service capability rate)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>CR register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <description>Allow debug of the CPU in SLEEP mode
- 0: Normal operation. All clocks will be disabled automatically in SLEEP mode
- 1: Automatic clock stop disabled. All active CPU clocks and oscillators will continue to run during SLEEP mode, allowing full CPU debug capability. On exit from SLEEP mode, the clock settings will be set to the SLEEP mode exit state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_STOP</name>
              <description>Allow debug of the CPU in DEEPSTOP mode
- 0: Normal operation. All clocks will be disabled automatically in STOP mode
- 1: Automatic clock stop disabled. All active CPU clocks and oscillators will continue to run during STOP mode, allowing full CPU debug capability. On exit from STOP mode, the clock settings will be set to the STOP mode exit state.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_APB0_FZ</name>
          <displayName>DBG_APB0_FZ</displayName>
          <description>DBG_APB0_FZ register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_TIM2_STOP</name>
              <description>TIM2 stop in the CPU debug
- 0: Normal operation. TIM2 continues to operate while the CPU is in debug mode
- 1: Stop in debug. TIM2 is frozen while the CPU is in debug mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM16_STOP</name>
              <description>TIM16 stop in the CPU debug
- 0: Normal operation. TIM16 continues to operate while the CPU is in debug mode
- 1: Stop in debug. TIM16 is frozen while the CPU is in debug mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <description>RTC stop in CPU debug
- 0: Normal operation. RTC continues to operate while the CPU is in debug mode
- 1: Stop in debug. RTC is frozen while the CPU is in debug mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>IWDG stop in the CPU debug
- 0: Normal operation. IWDG continues to operate while the CPU is in debug mode
- 1: Stop in debug. IWDG is frozen while the CPU is in debug mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_APB1_FZ</name>
          <displayName>DBG_APB1_FZ</displayName>
          <description>DBG_APB1_FZ register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_I2C1_STOP</name>
              <description>I2C1 SMBUS timeout stop in CPU debug
- 0: Normal operation. I2C1 SMBUS timeout continues to operate while the CPU is in debug mode
- 1: Stop in debug. I2C1 SMBUS timeou is frozen while the CPU is in debug mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_I2C2_STOP</name>
              <description>I2C2 SMBUS timeout stop in CPU debug
- 0: Normal operation. I2C2 SMBUS timeout continues to operate while the CPU is in debug mode
- 1: Stop in debug. I2C2 SMBUS timeou is frozen while the CPU is in debug mode.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
