KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA address block description</description>
      <groupName>DMA</groupName>
      <baseAddress>0x48700000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA</name>
        <description>DMA interrupt</description>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>DMA_ISR</name>
          <displayName>DMA_ISR</displayName>
          <description>DMA_ISR register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>GIF1</name>
              <description>GIF1: Channel 1 global interrupt flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No TE, HT or TC event on channel 1

1: A TE, HT or TC event occurred on channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF1</name>
              <description>TCIF1: Channel 1 transfer complete flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer complete (TC) event on channel 1

1: A transfer complete (TC) event occurred on channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF1</name>
              <description>HTIF1: Channel 1 half transfer flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No half transfer (HT) event on channel 1

1: A half transfer (HT) event occurred on channel 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F1</name>
              <description>TEIF1: Channel 1 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer error (TE) on channel 1

1: A transfer error (TE) occurred on channel 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF2</name>
              <description>GIF2: Channel 2 global interrupt flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No TE, HT or TC event on channel 2

1: A TE, HT or TC event occurred on channel 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF2</name>
              <description>TCIF2: Channel 2 transfer complete flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer complete (TC) event on channel 2

1: A transfer complete (TC) event occurred on channel 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF2</name>
              <description>HTIF2: Channel 2 half transfer flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No half transfer (HT) event on channel 2

1: A half transfer (HT) event occurred on channel 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F2</name>
              <description>TEIF2: Channel 2 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer error (TE) on channel 2

1: A transfer error (TE) occurred on channel 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF3</name>
              <description>GIF3: Channel 3 global interrupt flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No TE, HT or TC event on channel 3

1: A TE, HT or TC event occurred on channel 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF3</name>
              <description>TCIF3: Channel 3 transfer complete flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer complete (TC) event on channel 3

1: A transfer complete (TC) event occurred on channel 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF3</name>
              <description>HTIF3: Channel 3 half transfer flag

