KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
Base address of the peripheral data register from/to which the data will be read/written.

When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a halfword

address.

When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word

address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CMAR8</name>
          <displayName>DMA_CMAR8</displayName>
          <description>DMA_CMARx register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>MA</name>
              <description>MA[31:0]: Memory address

Base address of the memory area from/to which the data will be read/written.

When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a halfword

address.

When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word

address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DYNAMIC_REG</name>
      <groupName>DYNAMIC_REG</groupName>
      <baseAddress>0x49000500</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PCKTLEN_CONFIG</name>
          <displayName>PCKTLEN_CONFIG</displayName>
          <description>PCKTLEN_CONFIG register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000014</resetValue>
          <fields>
            <field>
              <name>PCKTLEN</name>
              <description>This bit field has different meanings/usages:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD0_CONFIG</name>
          <displayName>MOD0_CONFIG</displayName>
          <description>MOD0_CONFIG register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00083A93</resetValue>
          <fields>
            <field>
              <name>DATARATE_M</name>
              <description>The mantissa of the specified data rate (default: 38.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_E</name>
              <description>The exponent of the specified data rate (default: 38.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD_TYPE</name>
              <description>Select the modulation type
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONST_MAP</name>
              <description>Also known as FOUR_GFSK_CONST_MAP
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_SEL</name>
              <description>Select BT value for GFSK
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_CLKON_LOCKONTX</name>
              <description>Enable the clock on analog PA in LOCKONTX state
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD1_CONFIG</name>
          <displayName>MOD1_CONFIG</displayName>
          <description>MOD1_CONFIG register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00400435</resetValue>
          <fields>
            <field>
              <name>FDEV_M</name>
              <description>Mantissa of the frequency deviation (default: 28.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDEV_E</name>
              <description>Exponent of the frequency deviation (default: 28.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHFLT_M</name>
              <description>Mantissa of the channel filter BW (default: 100 kHz)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHFLT_E</name>
              <description>Exponent of the channel filter BW (default: 100 kHz)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SNYTH_FREQ</name>
          <displayName>SNYTH_FREQ</displayName>
          <description>SNYTH_FREQ register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x04851615</resetValue>
          <fields>
            <field>
              <name>SYNTH_FRAC</name>
              <description>Fractional part of the  PLL fractional divide factor (default: 868 MHz, XTAL: 48 MHz)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNTH_INT</name>
              <description>PLL integer divide factor (default: 868 MHz, XTAL: 48 MHz)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS</name>
              <description>Synthesizer band selector, i.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCO_CAL_CONFIG</name>
          <displayName>VCO_CAL_CONFIG</displayName>
          <description>VCO_CAL_CONFIG register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00400088</resetValue>
          <fields>
            <field>
              <name>VCO_CALAMP_EXT</name>
              <description>VCO magnitude calibration word in thermometric code
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_CALAMP_EXT_SEL</name>
              <description>Select the mode to provide an external VCO amplitude calibration value through VCO_CALAMP_EXT bit field
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_CALFREQ_EXT</name>
              <description>VCO Cbank frequency calibration word.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_CALFREQ_EXT_SEL</name>
              <description>Select the mode to provide an external VCO frequency calibration value through VCO_CALFREQ_EXT bit field
</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_CALIB_REQ</name>
              <description>Define if the Radio FSM must launch a VCO calibration request after VCO start-up
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_TIMER</name>
          <displayName>RX_TIMER</displayName>
          <description>RX_TIMER register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX_TIMEOUT</name>
              <description>RX timer timeout (relative duration in interpolated absolute time unit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CS_TIMEOUT_MASK</name>
              <description>- 0: CS flag does not contribute to timeout disabling
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PQI_TIMEOUT_MASK</name>
              <description>- 0: PREAMBLE valid flag does not contribute to timeout disabling
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SQI_TIMEOUT_MASK</name>
              <description>- 0: SYNC valid flag does not contribute to timeout disabling
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_OR_nAND_SELECT</name>
              <description>Select logical OR or logcial AND to apply on CS/PQI/SQI timeout mask
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFFER_THR</name>
          <displayName>DATABUFFER_THR</displayName>
          <description>DATABUFFER_THR register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX_ALMOST_FULL_THR</name>
              <description>Almost Full threshold for RX Data Buffers
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_THR</name>
              <description>Almost Empty threshold for TX Data Buffers.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFSEQ_IRQ_ENABLE</name>
          <displayName>RFSEQ_IRQ_ENABLE</displayName>
          <description>RFSEQ_IRQ_ENABLE register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TX_DONE_E</name>
              <description>Enable interrupt on TX_DONE_F flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_OK_E</name>
              <description>Enable interrupt on RX_OK_F flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TIMEOUT_E</name>
              <description>Enable interrupt on RX_TIMEOUT_F flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CRC_ERROR_E</name>
              <description>Enable interrupt on RX_CRC_ERROR_F flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_RX_TERM_E</name>
              <description>Enable interrupt on FAST_RX_TERM_F flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMER_STOP_CDT_E</name>
              <description>Enable interrupt on RXTIMER_STOP_CDT_F flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SABORT_DONE_E</name>
              <description>Enable interrupt on SABORT command treated and done flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND_REJECTED_E</name>
              <description>Enable interrupt on COMMAND_REJECTED flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_E</name>
              <description>Enable interrupt on CS_F flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_VALID_E</name>
              <description>Enable interrupt on PREAMBLE_VALID_F flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_VALID_E</name>
              <description>Enable interrupt on SYNC_VALID_F flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATABUFFER0_USED_E</name>
              <description>Enable interrupt on DATABUFFER0_USED_F flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATABUFFER1_USED_E</name>
              <description>Enable interrupt on DATABUFFER1_USED_F flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ALMOST_FULL_0_E</name>
              <description>Enable interrupt on RX_ALMOST_FULL_0_F flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ALMOST_FULL_1_E</name>
              <description>Enable interrupt on RX_ALMOST_FULL_1_F flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_0_E</name>
              <description>Enable interrupt on TX_ALMOST_EMPTY_0_F flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_1_E</name>
              <description>Enable interrupt on TX_ALMOST_EMPTY_1_F flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_ACCESS_ERROR_E</name>
              <description>Enable interrupt on AHB_ACCESS_ERROR_F flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_ANA_FAILURE_E</name>
              <description>Enable interrupt on HW_ANA_FAILURE_F flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_E</name>
              <description>Enable interrupt on SEQ_F flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RRM_CMD_START_E</name>
              <description>Enable interrupt on RRM_CMD_END_F flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RRM_CMD_END_E</name>
              <description>Enable interrupt on RRM_CMD_END_F flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAFEASK_CALIB_DONE_E</name>
              <description>Enable interrupt on SAFEASK_CALIB_DONE_F flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_CALIB_DONE_E</name>
              <description>Enable interrupt on AGC_CALIB_DONE_F flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDITIONAL_CTRL</name>
          <displayName>ADDITIONAL_CTRL</displayName>
          <description>ADDITIONAL_CTRL register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00038800</resetValue>
          <fields>
            <field>
              <name>CH_NUM</name>
              <description>Channel number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_SPACING</name>
              <description>Channel spacing.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PA_FC</name>
              <description>Power control bandwidth selection according data rate
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIME_CAPTURESEL</name>
              <description>Select the trigger event to capture the interpolated absolute time in the TIME_CAPTURE[31:0] register
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS_ENABLE</name>
              <description>Enable the antenna switching feature.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAST_RX_TIMER</name>
          <displayName>FAST_RX_TIMER</displayName>
          <description>FAST_RX_TIMER register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAST_RX_TIMEOUT</name>
              <description>Fast RX termination timer value (corresponding to the delay to measure the RSSI and to let the HW check CS flag information)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_CS_TERM_EN</name>
              <description>Enable the Fast RX Termination feature
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND</name>
          <displayName>COMMAND</displayName>
          <description>COMMAND register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMMAND_ID</name>
              <description>Opcode coresponding to a command:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2ACTIVE</name>
              <description>Select the default/return state for the Radio FSM to be ACTIVE2
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2LOCKON</name>
              <description>Request to the Radio FSM to stay in LOCKON state when exiting a RX or a TX
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
