KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
        <register>
          <name>BSRR</name>
          <displayName>BSRR</displayName>
          <description>BSRR register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BS0</name>
              <description>BS0: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.
0: No action on the corresponding ODx bit
1: Sets the corresponding ODx bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS1</name>
              <description>BS1: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.
0: No action on the corresponding ODx bit
1: Sets the corresponding ODx bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS2</name>
              <description>BS2: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.
0: No action on the corresponding ODx bit
1: Sets the corresponding ODx bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS3</name>
              <description>BS3: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS4</name>
              <description>BS4: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS5</name>
              <description>BS5: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS6</name>
              <description>BS6: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS7</name>
              <description>BS7: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS8</name>
              <description>BS8: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS9</name>
              <description>BS9: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS10</name>
              <description>BS10: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS11</name>
              <description>BS11: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS12</name>
              <description>BS12: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS13</name>
              <description>BS13: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS14</name>
              <description>BS14: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS15</name>
              <description>BS15: Port A set bit y 
These bits are write-only. A read to these bits returns the value 0x0000.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR0</name>
              <description>BR0: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR1</name>
              <description>BR1: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR2</name>
              <description>BR2: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR3</name>
              <description>BR3: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR4</name>
              <description>BR4: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR5</name>
              <description>BR5: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR6</name>
              <description>BR6: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR7</name>
              <description>BR7: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR8</name>
              <description>BR8: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR9</name>
              <description>BR9: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR10</name>
              <description>BR10: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR11</name>
              <description>BR11: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR12</name>
              <description>BR12: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR13</name>
              <description>BR13: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR14</name>
              <description>BR14: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR15</name>
              <description>BR15: Port A reset bit y
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit
Note: If both BSx and BRx are set, BSx has priority.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <displayName>LCKR</displayName>
          <description>LCKR register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LCK0</name>
              <description>LCK0: Port A lock bit 0
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK1</name>
              <description>LCK1: Port A lock bit 1
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK2</name>
              <description>LCK2: Port A lock bit 2
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK3</name>
              <description>LCK3: Port A lock bit 3
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK4</name>
              <description>LCK4: Port A lock bit 4
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK5</name>
              <description>LCK5: Port A lock bit 5
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK6</name>
              <description>LCK6: Port A lock bit 6
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK7</name>
              <description>LCK7: Port A lock bit 7
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK8</name>
              <description>LCK8: Port A lock bit 8
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK9</name>
              <description>LCK9: Port A lock bit 9
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK10</name>
              <description>LCK10: Port A lock bit 10
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK11</name>
              <description>LCK11: Port A lock bit 11
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK12</name>
              <description>LCK12: Port A lock bit 12
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK13</name>
              <description>LCK13: Port A lock bit 13
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK14</name>
              <description>LCK14: Port A lock bit 14
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK15</name>
              <description>LCK15: Port A lock bit 15
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked
-1: Port configuration locked</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCKK</name>
              <description>LCKK: Lock key
This bit can be read any time. It can only be modified using the lock key write sequence.
-0: Port configuration lock key not active
-1: Port configuration lock key active. The GPIOx_LCKR register is locked until the next MCU
reset or peripheral reset.
LOCK key write sequence:
WR LCKR[16] = 1 + LCKR[15:0]
WR LCKR[16] = 0 + LCKR[15:0]
WR LCKR[16] = 1 + LCKR[15:0]
RD LCKR
RD LCKR[16] = 1 (this read operation is optional but it confirms that the lock is active)
Note: During the LOCK key write sequence, the value of LCK[15:0] must not change.
Any error in the lock sequence aborts the lock.
After the first lock sequence on any bit of the port, any read access on the LCKK bit will
return 1 until the next MCU reset or peripheral reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
