KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
        <register>
          <name>AFRL</name>
          <displayName>AFRL</displayName>
          <description>AFRL register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <displayName>AFRH</displayName>
          <description>AFRH register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>y[3:0]: Alternate function selection for port A pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <displayName>BRR</displayName>
          <description>BRR register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BR0</name>
              <description>BR0: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR1</name>
              <description>BR1: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR2</name>
              <description>BR2: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR3</name>
              <description>BR3: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR4</name>
              <description>BR4: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR5</name>
              <description>BR5: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR6</name>
              <description>BR6: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR7</name>
              <description>BR7: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR8</name>
              <description>BR8: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR9</name>
              <description>BR9: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR10</name>
              <description>BR10: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR11</name>
              <description>BR11: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR12</name>
              <description>BR12: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR13</name>
              <description>BR13: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR14</name>
              <description>BR14: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BR15</name>
              <description>BR15: Port A reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit
-1: Resets the corresponding ODx bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
