KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
        <register>
          <name>PUPDR</name>
          <displayName>PUPDR</displayName>
          <description>PUPDR register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>PUPD0: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD1</name>
              <description>PUPD1: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD2</name>
              <description>PUPD2: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD3</name>
              <description>PUPD3: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD4</name>
              <description>PUPD4: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD5</name>
              <description>PUPD5: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD6</name>
              <description>PUPD6: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD7</name>
              <description>PUPD7: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD8</name>
              <description>PUPD8: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD9</name>
              <description>PUPD9: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD10</name>
              <description>PUPD10: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD11</name>
              <description>PUPD11: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD12</name>
              <description>PUPD12: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD13</name>
              <description>PUPD13: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD14</name>
              <description>PUPD14: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD15</name>
              <description>PUPD15: Port B configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>IDR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID0</name>
              <description>ID0:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID1</name>
              <description>ID1:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID2</name>
              <description>ID2:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID3</name>
              <description>ID3:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID4</name>
              <description>ID4:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID5</name>
              <description>ID5:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID6</name>
              <description>ID6:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID7</name>
              <description>ID7:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID8</name>
              <description>ID8:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID9</name>
              <description>ID9: Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID10</name>
              <description>ID10:  Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID11</name>
              <description>ID11: Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID12</name>
              <description>ID12: Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID13</name>
              <description>ID13: Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID14</name>
              <description>ID14: Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID15</name>
              <description>ID15: Port B input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <displayName>ODR</displayName>
          <description>ODR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OD0</name>
              <description>OD0:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD1</name>
              <description>OD1:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD2</name>
              <description>OD2:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD3</name>
              <description>OD3:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD4</name>
              <description>OD4:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD5</name>
              <description>OD5:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD6</name>
              <description>OD6:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD7</name>
              <description>OD7:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD8</name>
              <description>OD8:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD9</name>
              <description>OD9: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD10</name>
              <description>OD10:  Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD11</name>
              <description>OD11: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD12</name>
              <description>OD12: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD13</name>
              <description>OD13: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD14</name>
              <description>OD14: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD15</name>
              <description>OD15: Port B output data bit
These bits can be read and written by software</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
