KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LCSC</name>
      <groupName>LCSC</groupName>
      <baseAddress>0x4000A000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x48</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCSC</name>
        <description>LCSC interrupt</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>LC_ACTIVITY</name>
        <description>LCSC LC_ACTIVITY interrupt</description>
        <value>29</value>
      </interrupt>
      <registers>
        <register>
          <name>LCSC_CR0</name>
          <displayName>LCSC_CR0</displayName>
          <description>LCSC_CR0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000B005C</resetValue>
          <fields>
            <field>
              <name>TMEAS</name>
              <description>Measurement Time
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCAP</name>
              <description>Capture Time
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TICAP</name>
              <description>Inter Capture Time
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_CR1</name>
          <displayName>LCSC_CR1</displayName>
          <description>LCSC_CR1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x3C010C80</resetValue>
          <fields>
            <field>
              <name>LCAB_DAMP_THRES</name>
              <description>LCAB_DAMP_THRES[7:0]: Damping threshold for LCA and LCB
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TREC_VCM</name>
              <description>VCMBUFF Recovery Time
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTART_VCM</name>
              <description>VCMBUFF Starting Time
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_CR2</name>
          <displayName>LCSC_CR2</displayName>
          <description>LCSC_CR2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>TAMP_PSC</name>
              <description>Tamper measurement interval.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCT_DAMP_THRES</name>
              <description>Damping threshold for LCT
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_PULSE_CR</name>
          <displayName>LCSC_PULSE_CR</displayName>
          <description>LCSC_PULSE_CR register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000070</resetValue>
          <fields>
            <field>
              <name>LCAB_PULSE_WIDTH</name>
              <description>Low Pulse Width for LCA and LCB
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCT_PULSE_WIDTH</name>
              <description>Low Pulse Width for LCT
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_ENR</name>
          <displayName>LCSC_ENR</displayName>
          <description>LCSC_ENR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKWISE_IE</name>
              <description>Clock Wise Interrupt and Wakeup Enable
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACLKWISE_IE</name>
              <description>Anti Clock Wise Interrupt and Wakeup Enable
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMP_IE</name>
              <description>Tamper Interrupt and Wakeup Enable
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_OFB_WKP_IE</name>
              <description>LCAB Counter Out Of Bound wakeup enable
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCSC_EN</name>
              <description>LCSC Enable
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_WHEEL_SR</name>
          <displayName>LCSC_WHEEL_SR</displayName>
          <description>LCSC_WHEEL_SR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKWISE</name>
              <description>Number of Clock Wise revolutions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACLKWISE</name>
              <description>Number of Anti Clock Wise revolutions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_CONFR</name>
          <displayName>LCSC_CONFR</displayName>
          <description>LCSC_CONFR register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKWISE_THRES</name>
              <description>Number of Clock Wise revolutions target</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACLKWISE_THRES</name>
              <description>Number of Anti Clock Wise revolutions target</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_COMP_CTN</name>
          <displayName>LCSC_COMP_CTN</displayName>
          <description>LCSC_COMP_CTN register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP_LCA_CNT</name>
              <description>LCA Comparator last damping count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMP_LCB_CNT</name>
              <description>LCB Comparator last damping count</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMP_LCT_CNT</name>
              <description>LCT Comparator last damping count</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_SR</name>
          <displayName>LCSC_SR</displayName>
          <description>LCSC_SR register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKWISE_STATE</name>
              <description>The current state of the LCSC clockwise FSM:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACLKWISE_STATE</name>
              <description>The current state of the LCSC anti clockwise FSM:
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LAST_DIR</name>
              <description>The last direction detected:
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_STAT</name>
          <displayName>LCSC_STAT</displayName>
          <description>LCSC_STAT register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFF0000FF</resetValue>
          <fields>
            <field>
              <name>MIN_LCAB_CNT</name>
              <description>The Minimum of CMP_LCA_CNT, CMP_LCB_CNT reached during the
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_LCAB_CNT</name>
              <description>The Maximum of CMP_LCA_CNT, CMP_LCB_CNT reached during
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIN_LCAB_CNT_BOUND</name>
              <description>The Minimum bound of CMP_LCA_COUNT,
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_LCAB_CNT_BOUND</name>
              <description>The Maximum bound of CMP_LCA_COUNT,
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_TST_CFG</name>
          <displayName>LCSC_TST_CFG</displayName>
          <description>LCSC Test Configuration Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TST_EN</name>
              <description>Test Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TST_CFG</name>
              <description>DTB output selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_ANATST_CFG</name>
          <displayName>LCSC_ANATST_CFG</displayName>
          <description>LCSC ANA Test Configuration Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VCMBUFF_ENOUT_SEL</name>
              <description>Selection of the signal to be used to supply the DAC in the LCSC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCMBUFF_ENOUT</name>
              <description>VCMBUFFER output buffer enable pin</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCMBUFF_PWDN_SEL</name>
              <description>Selection of the signal to be used to supply the DAC in the LCSC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCMBUFF_PWDN</name>
              <description>VCMBUFF power-down pin</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_PWDN_SEL</name>
              <description>Selection of the signal to be used to supply the COMP in the LCSC 
Analog part</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_PWDN</name>
              <description>COMP power-down pin</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_PWDN_SEL</name>
              <description>Selection of the signal to be used to supply the DAC in the LCSC Analog 
part</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_PWDN</name>
              <description>DAC power-down pin</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_VER</name>
          <displayName>LCSC_VER</displayName>
          <description>LCSC_VER register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>REV</name>
              <description>Revision of the RFIP to be used for metal fixes)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VER</name>
              <description>Version of the RFIP  (to be used for cut upgrades)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROD</name>
              <description>Used for major upgrades (new protocols support / new features)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSC_ISR</name>
          <displayName>LCSC_ISR</displayName>
          <description>LCSC_ISR register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKWISE_F</name>
              <description>Clock Wise Flag:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACLKWISE_F</name>
              <description>Anti Clock Wise Flag:
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMP_F</name>
              <description>Tamper Flag
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_OFB_F</name>
              <description>Out of Bound Counter Flag
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
