KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LPAWUR</name>
      <groupName>LPAWUR</groupName>
      <baseAddress>0x49001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPAWUR</name>
        <description>LPAWUR interrupt</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>CPU_WKUP</name>
        <description>CPU Wakeup interrupt</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>SUBG_WKUP</name>
        <description>SUBG Wakeup interrupt</description>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>FRAME_CONFIG0</name>
          <displayName>FRAME_CONFIG0</displayName>
          <description>FRAME_CONFIG0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02074012</resetValue>
          <fields>
            <field>
              <name>PREAMBLE_THRESHOLD_COUNT</name>
              <description>The number of transitions for preamble detection when receiving the manchester encoded preamble.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_LENGTH</name>
              <description>Frame sync pattern length ( Manchester encoded ).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_THRESHOLD_COUNT</name>
              <description>detection threshold when receivng the Frame sync ( Manchester encoded).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAYLOAD_LENGTH</name>
              <description>The number of data Bytes in the payload ( decoded ).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOW_CLK_CYCLE_PER_BIT_CNT</name>
              <description>The number of expected slow clock cycle per each manchester coded bit.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME_CONFIG1</name>
          <displayName>FRAME_CONFIG1</displayName>
          <description>FRAME_CONFIG1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00024669</resetValue>
          <fields>
            <field>
              <name>KI</name>
              <description>ki gain value for the timing recovery loop.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KP</name>
              <description>kp gain value for the timing recovery loop.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_SYNC_COUNTER_TIMEOUT</name>
              <description>The timeout in manchester encoded bits for the Frame Sync,it represents the number of samples after which in case the frame sync is not detected a sync_error is raised.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_ENABLE</name>
              <description>Preamble detection enable
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TREC_LOOP_ALGO_SEL</name>
              <description>Timing recovery loop algorithm selection:
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME_SYNC_CONFIG</name>
          <displayName>FRAME_SYNC_CONFIG</displayName>
          <description>FRAME_SYNC_CONFIG register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00009696</resetValue>
          <fields>
            <field>
              <name>FRAME_SYNC_PATTERN_L</name>
              <description>The value of the frame sync pattern, Low word, manchester encoded, used when the frame sync length is 16 bit (default 0x9696 which represent a frame sync value of 0x99)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_SYNC_PATTERN_H</name>
              <description>The value of the frame sync pattern, High word, manchester encoded, used only when the frame sync length is 32 bits (default 0x0000 )</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIP_CONFIG</name>
          <displayName>RFIP_CONFIG</displayName>
          <description>RFIP_CONFIG register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>LPAWUR_ENABLE</name>
              <description>Enable (start) or Disable (stop) the LPAWUR feature (0: disabled by default)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_LEVEL</name>
              <description>- 00: the bit Sync has been detected
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CONFIG</name>
          <displayName>RF_CONFIG</displayName>
          <description>RF_CONFIG register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000133EE</resetValue>
          <fields>
            <field>
              <name>ED_SWITCH</name>
              <description>- 0 : Normal operation (default) 
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Calibrate 4kHz clock (programmable divider)
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_LOW_LVL</name>
              <description>AGC level (Low) (default value: 0x2)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ED_DC_CTRL</name>
              <description>DC current subtraction enabling signal (default value: 0x1)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_HIGH_LVL</name>
              <description>AGC level (High) (default value: 0x4)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ED_ICAL</name>
              <description>Current versus VBAT calibration for ED
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPF3_CAL</name>
              <description> </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_CONFIG</name>
          <displayName>AGC_CONFIG</displayName>
          <description>AGC_CONFIG register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AGC_MODE</name>
              <description>Define the working mode of the AGC:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_HOLD_MODE</name>
              <description>The behavior when the AGC is ON and is working in HOLD mode
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_RESET_MODE</name>
              <description>The AGC reset behavior when the AGC is working in ON or HOLD mode
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAYLOAD_0</name>
          <displayName>PAYLOAD_0</displayName>
          <description>PAYLOAD_0 register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PAYLOAD_0</name>
              <description>First part of the payload (Least significant Byte First)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAYLOAD_1</name>
          <displayName>PAYLOAD_1</displayName>
          <description>PAYLOAD_1 register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PAYLOAD_1</name>
              <description>Second part of the payload  (Least significant Byte First)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
