KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
        <register>
          <name>AGC4_CTRL</name>
          <displayName>AGC4_CTRL</displayName>
          <description>AGC4_CTRL register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>AGC_FREEZE_THR</name>
              <description>Signal threshold for the autofreeze feature.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_PGA_HWTRIM_OUT</name>
          <displayName>AGC_PGA_HWTRIM_OUT</displayName>
          <description>AGC_PGA_HWTRIM_OUT register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AGC_HW_PGA_TRIM</name>
              <description>AGC PGA calibration information loaded by HW from the SoC flash.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_REG</name>
          <displayName>PA_REG</displayName>
          <description>PA_REG register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CFG_FILT</name>
              <description>FIR configuration:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_DEGEN_ON</name>
              <description>Enable a 'degeneration' mode, which introduces a pre-distortion to linearize the power control curve.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_HWTRIM_OUT</name>
          <displayName>PA_HWTRIM_OUT</displayName>
          <description>PA_HWTRIM_OUT register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000088</resetValue>
          <fields>
            <field>
              <name>PA_HW_DEGEN_TRIM</name>
              <description>MSB part meaning:
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI_FLT</name>
          <displayName>RSSI_FLT</displayName>
          <description>RSSI_FLT register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000E0</resetValue>
          <fields>
            <field>
              <name>OOK_PEAK_DECAY</name>
              <description>Peak decay control for OOK: 3 slow decay; 0 fast decay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_FLT</name>
              <description>Gain of the RSSI filter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTH2_ANA_ENG</name>
          <displayName>SYNTH2_ANA_ENG</displayName>
          <description>SYNTH2_ANA_ENG register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000004C</resetValue>
          <fields>
            <field>
              <name>RFD_PLL_VCO_ALC_AMP</name>
              <description>Select the level of max VCO amplitude in amplitude level control loop.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFD_PLL_LD_WIN_ACC</name>
              <description>Select the PLL lock detector window selection:
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXADC_HWDELAYTRIM_OUT</name>
          <displayName>RXADC_HWDELAYTRIM_OUT</displayName>
          <description>RXADC_HWDELAYTRIM_OUT register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>RXADC_HW_DELAYTRIM_I</name>
              <description>Control bits of the RX ADC loop delay for I channel (from SoC Flash).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXADC_HW_DELAYTRIM_Q</name>
              <description>Control bits of the RX ADC loop delay for Q channel (from SoC Flash).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_AAF_HWTRIM_OUT</name>
          <displayName>RX_AAF_HWTRIM_OUT</displayName>
          <description>RX_AAF_HWTRIM_OUT register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AAF_HW_FCTRIM</name>
              <description>AAF calibration information loaded by HW.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGEN_ANA_ENG</name>
          <displayName>SINGEN_ANA_ENG</displayName>
          <description>SINGEN_ANA_ENG register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFD_SINGEN_ENA</name>
              <description>Enable SINGEN signal for the RFSUBGanalog IP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFD_SINGEN_DIV2_PUP</name>
              <description>This bit value is directly connected to the RFSUBG analog IP pin.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFD_SINGEN_LBE</name>
              <description>This bit value is directly connected to the RFSUBG analog IP pin.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_INFO_OUT</name>
          <displayName>RF_INFO_OUT</displayName>
          <description>RF_INFO_OUT register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>FQCY_BAND_ID</name>
              <description>FQCY_BAND_ID[3:0]: Indicates the version of the RFSUBG IP embedded in the device
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFSUBG_ID</name>
              <description>Indicate the version of the analog RFSUBG IP embedded in the device
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM8_TIMEOUT</name>
          <displayName>RF_FSM8_TIMEOUT</displayName>
          <description>RF_FSM8_TIMEOUT register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>SYNTH_PDWN_TIMER</name>
              <description>Timeout management for the RF regulator to stabilize after PLL shut down
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM9_TIMEOUT</name>
          <displayName>RF_FSM9_TIMEOUT</displayName>
          <description>RF_FSM9_TIMEOUT register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>END_RX_TIMER</name>
              <description>Timeout management for the RF regulator to stabilize after analog RX chain shut down
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM10_TIMEOUT</name>
          <displayName>RF_FSM10_TIMEOUT</displayName>
          <description>RF_FSM10_TIMEOUT register</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>END_TX_TIMER</name>
              <description>Timeout management for the RF regulator to stabilize after clock stops on the analog PA block
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBG_DIG_CTRL0</name>
          <displayName>SUBG_DIG_CTRL0</displayName>
          <description>SUBG_DIG_CTRL0 register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FORCE_GPIO_OUTPUT</name>
              <description>Option for the direct GPIO signal output
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHAIN_ENG</name>
          <displayName>RX_CHAIN_ENG</displayName>
          <description>RX_CHAIN_ENG register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>LNA_ISOL_ENA</name>
              <description>Option for LNA during the EN_RX state of the Radio FSM:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGA_PRECH_ENA</name>
              <description>Option for PGA precharge during the EN_RX state of the Radio FSM:
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOD_DIG_ENG</name>
          <displayName>DEMOD_DIG_ENG</displayName>
          <description>DEMOD_DIG_ENG register</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>RX_BLANKING_LENGTH</name>
              <description>Number of data samples at RX start for which the signal at the output of the channel filter is kept forced to zero:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
