KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <groupName>RCC</groupName>
      <baseAddress>0x48400000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC</name>
        <description>Reset and Clock Controller</description>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>CR register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00001400</resetValue>
          <fields>
            <field>
              <name>LSION</name>
              <description>Internal Low Speed oscillator enable
Set and reset by software.
Reset source only for this field: PORESETn
0: LSI RC oscillator OFF
1: LSI RC oscillator ON</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>Internal Low Speed oscillator Ready
Set and reset by hardware to indicate when the Low Speed Internal RC oscillator is stable.
Reset source only for this field: PORESETn
0: LSI RC oscillator not ready
1: LSI RC oscillator ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEON</name>
              <description>External Low Speed Clock enable.
Set and reset by software.
Reset source only for this field: PORESETn
0: LSE oscillator OFF
1: LSE oscillator ON
Note that enablng this bit, the configuration of PB12 and PB13 will be bypassed (whatever DFTMUX or AF selection)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDY</name>
              <description>External Low Speed Clock ready flag.
Set by hardware to indicate that LSE oscillator is stable. 
0: LSE oscillator not ready
1: LSE oscillator ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEBYP</name>
              <description>External Low Speed Clock bypass.
Set and reset by software.
Reset source only for this field: PORESETn
0: LSE oscillator bypass OFF
1: LSE oscillator bypass ON 
Note that enablng this bit, the configuration of PB13 will be bypassed (whatever DFTMUX or AF selection)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKDET_NSTOP</name>
              <description>Lock detector Nstop value
When start_stop signal is high; a counter is incremented every 16 MHz clock cycle. When the counter reaches (NSTOP+1) x 64 value, the lock_det signal is set high indicating that the PLL is locked. As soon as the start_stop signal is low the counter is reset to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>Internal High Speed clock ready flag.
Set by hardware to indicate that internal RC 64MHz oscillator is stable. 
This bit is activated only if the RC is enabled by HSION (it is not activated if the RC is enabled by an IP request).
0: internal RC 64 MHz oscillator not ready
1: internal RC 64 MHz oscillator ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEPLLBUFON</name>
              <description>External High Speed Clock Buffer for PLL RF  enable.
Set and reset by software.
0: HSE PLL Buffer OFF
1: HSE PLL Buffer ON (default)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIPLLON</name>
              <description>Internal High Speed Clock PLL enable
0: PLL is OFF
1: PLL is ON</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIPLLRDY</name>
              <description>Internal High Speed Clock PLL ready flag.
0: PLL is unlocked
1: PLL is locked</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FMRAT</name>
              <description>Force MRSUBG accurate clock ready status (for debug purpose)
0: no effect
1: active_transmission is force to '1' whatever the HSIPLLRDY/HSE status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEON</name>
              <description>External High Speed Clock enable.
Set and reset by software.
in low power mode, HSE is turned off.  
HSE is turned ON only when RFSUBG LDO is Ready
0: HSE oscillator OFF
1: HSE oscillator ON</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDY</name>
              <description>External High Speed Clock ready flag.
Set by hardware to indicate that HSE oscillator is stable. 
0: HSE oscillator not ready
1: HSE oscillator ready</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <displayName>ICSCR</displayName>
          <description>ICSCR register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x3f000000</resetValue>
          <fields>
            <field>
              <name>LSITRIMEN</name>
              <description>Low Speed oscillator trimming enable
Set and reset by software.
Reset source only for this field: PORESETn
0: LSI oscillator Bias trimming disabled
1: LSI oscillator Bias trimming enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSITRIMOK</name>
              <description>LSITRIMOK: Low Speed oscillator trimming OK
Set and reset by hardware to indicate when the Low Speed Internal RC oscillator has reached an optimal trimming of its bias current; this bit is only valid when LSITRIMEN is active.
0: LSI Bias trimming (LSIBW) is not good
1: LSI Bias trimming (LSIBW) value is OK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSIBW</name>
              <description>Trimming in test mode
The value stored is the correspondent Engi Byte and represents the actual value driving the input of the hardware macro.
This value is loaded soon after the completion of the Option Byte Loading procedure.
This field is directly writeable only in Test Mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSITRIMOFFSET</name>
              <description>ICSCR[18:16] = HSITRIMOFFSET[2:0]: High Speed oscillator signed trimming offset 
 000: 0 (+ 0 MHz / default)
 001: 1 (-0.5 MHz)
 010: 2 (-1MHz)
 011: 3 (-1.5 MHz)
 100: -1 (+2 MHz)
 101: -2 (+1.5MHz)
 110: -3 (+1 MHz)
 111: -4 (+0.5 MHz)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSITRIM</name>
              <description>High Speed Internal clock trimming.
This value is loaded soon after the completion of the Option Byte Loading procedure.
When max value 0x3f is set, HSI is less than 64MHz</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>CFGR register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000240</resetValue>
          <fields>
            <field>
              <name>HSESEL</name>
              <description>Clock source selection request:
0: HSI clock source is requested (default)
1: HSE clock source is requested</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOPHSI</name>
              <description>Stop HSI clock source request
0: HSI is enabled (default)
1: disable HSI is requested</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSESEL_STATUS</name>
              <description>Clock source selection Status
0: HSI clock source is selected
1: HSE clock source is selected
Mirror the actual system clock source, depending on clock switching mechanism and limitations</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKSYSDIV</name>
              <description>system clock frequency selection request
000: div1 (HSI 64M / HSE 48M)
001: div2 (HSI 32M / HSE 24M)
010: div4/div3 (HSI/HSE)  (16M)
011: div8/div6 (HSI/HSE)  (8M) *
100: div16/div12 (HSI/HSE)  (4M) *
101: div32/div24 (HSI/HSE)  (2M) *
110: div64/div48 (HSI/HSE)  (1M) *
Note: behavior depends on depending on CFGR.HSESEL and (*) APB2ENR.MRSUBGEN or LPAWUREN register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSYSDIV_STATUS</name>
              <description>system clock frequency selection status
000: div1 (HSI 64M / HSE 48M)
001: div2 (HSI 32M / HSE 24M)
010: div4/div3 (HSI/HSE)  (16M)
011: div8/div6 (HSI/HSE)  (8M)
100: div16/div12 (HSI/HSE)  (4M)
101: div32/div24 (HSI/HSE)  (2M)
110: div64/div48 (HSI/HSE)  (1M)
Note: behavior depends on depending on CFGR.HSESEL and APB2ENR.MRSUBGEN register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMPSDIV</name>
              <description>SMPS clock prescaling factor to generate 4MHz or 8MHz 
0: SMPS clock 8MHz   (default )
1: SMPS clock 4MHz</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUCLKSEL</name>
              <description>LPUCLKSEL: Selection of LPUART clock
0: 16 MHz peripheral clock (default)
1: LSE clock (Mandatory in LPUART deepstop mode)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSLOWSEL</name>
              <description>slow clock source selection
Set by software to select the clock source. This is no glitch free mechanism
Reset source only for this field: PORESETn
00: '0' (default)
01: LSE oscillator clock used as slow clock
10: LSI oscillator clock used as slow clock
11:HSI_64M divided by 2048 used as slow clock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOBOOSTEN</name>
              <description>IOBOOSTEN: IO BOOSTER enable
0: IO BOOSTER block is disabled
1: IO BOOSTER block is enabled.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCOEN</name>
              <description>LCOEN: LCO enable on PA10 also in deepstop.
0: LCO output on PA10 is disabled
1: LCO output on PA10 is enabled.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3I2SCLKSEL</name>
              <description>SPI3I2SCLKSEL: Selection of I2S clock for SPI3 IP.
00: 32 MHz peripheral clock (default)
01: 16 MHz peripheral clock
10: CLK_SYS
11: CLK_SYS
Note: the I2S clock frequency must be higher or equal to the system clock (configured
through RCC_CFGR.CLKSYSDIV[2:0] bit field).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCOSEL</name>
              <description>Low speed Configurable Clock Output Selection.
Set and reset by software. Glitches propagation possible.
Reset source only for this field: PORESETn
00: LCO output disabled, no clock on LCO
01: not used
10: internal 32 KHz (LSI) oscillator clock selected
11: external 32 KHz (LSE) oscillator clock selected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCOSEL</name>
              <description>Main Configurable Clock Output Selection.
Set and reset by software. Glitches propagation possible.
000: MCO output disabled, no clock on MCO
001: system clock selected
010: na
011: internal RC 64 MHz (HSI) oscillator clock selected
100: external oscillator (HSE) clock selected
101: internal RC 64 MHz (HSI) oscillator divided by 2048 and used as slow clock selected
110: SMPS clock selected
111: AUX ADC ANA clock selected</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCOPRE</name>
              <description>Configurable Clock Output Prescaler.
Set and reset by software. 
Glitches propagation if CCOPRE is modified after CCO output is enabled.
000: CCO clock is divided by 1
001: CCO clock is divided by 2
010: CCO clock is divided by 4
011: CCO clock is divided by 8
100: CCO clock is divided by 16
101: CCO clock is divided by 32
Others: not used</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSSWCR</name>
          <displayName>CSSWCR</displayName>
          <description>CSSWCR register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSISWTRIMEN</name>
              <description>Low Speed oscillator trimming by SW enable
Set and reset by software.
Reset source only for this field: PORESETn
0: LSI oscillator Bias trimming by SW disabled
1: LSI oscillator Bias trimming by  SW enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSISWBW</name>
              <description>Low Speed Internal clock trimming value to set by SW
Reset source only for this field: PORESETn</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEDRV</name>
              <description>Maximum Crystal gm for Low Speed External XO
(to connect to XTDRV of 32kHz LSE XO =&gt; into IO V33?) to amplify drinving capacity modulation
Set by software. 
Reset source only for this field: PORESETn
00: 0.0, low drive capability
01: 0.1,  medium low drive capability
10: 1.0, medium high drive capability
11: 1.1, highdrive capability</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSISWTRIMEN</name>
              <description>High Speed oscillator trimming by SW enable
Set and reset by software.
0: HSI oscillator Bias trimming by SW disabled
1: HSI oscillator Bias trimming by SW enabled</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSITRIMSW</name>
              <description>High Speed Internal clock trimming value to set by SW.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KRMR</name>
          <displayName>KRMR</displayName>
          <description>KRMR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>KRM_EN</name>
              <description>KRM_EN: Variable rate multiplier Enable
Reset source only for this field: PORESETn
0: KRM is disabled (default)
1: KRM is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KRM</name>
              <description>KRM[4:0] :SMPS clock dividing Ratio (CLK_SPMS_KRM frequency= CLK_ROOT frequency
(depending on RCC_CFGR.HSESEL) divided by KRM when KRMEN=1)
Reset source only for this field: PORESETn
- 0x00 to 0x08: SMPS clock frequency equals CLK_ROOT/8 (8.00 MHz / 6.00 MHz)
- 0x09: SMPS clock frequency equals CLK_ROOT/9 (7.11 MHz / 5.33 MHz)
- 0x0A: SMPS clock frequency equals CLK_ROOT/10 (6.40 MHz / 4.80 MHz)
- 0x0B: SMPS clock frequency equals CLK_ROOT/11 (5.82 MHz / 4.36 MHz)
- 0x0C: SMPS clock frequency equals CLK_ROOT/12 (5.33 MHz / 4.00 MHz)
- 0x0D: SMPS clock frequency equals CLK_ROOT/13 (4.92 MHz / 3.69 MHz)
- 0x0E: SMPS clock frequency equals CLK_ROOT/14 (4.57 MHz / 3.43 MHz)
- 0x0F: SMPS clock frequency equals CLK_ROOT/15 (4.27 MHz / 3.20 MHz)
- 0x10: SMPS clock frequency equals CLK_ROOT/16 (4.00 MHz / 3.00 MHz)
- 0x1x: Reserved
Note: SMPS clock frequency must be selected in a range [4-8] MHz (depending on
RCC_KRMR.KRM and RCC_CFGR.HSESEL).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
