KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
        <register>
          <name>APB0SMENR</name>
          <displayName>APB0SMENR</displayName>
          <description>APB0SMENR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FF03</resetValue>
          <fields>
            <field>
              <name>TIM2SMEN</name>
              <description>TIM2 bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: TIM2 bus clock disabled in Sleep mode
- 1: TIM2 bus clock enabled in Sleep mode (if enabled in TIM2EN)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM16SMEN</name>
              <description>TIM16 bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: TIM16 bus clock disabled in Sleep mode
- 1: TIM16 bus clock enabled in Sleep mode (if enabled in TIM16EN)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCFGSMEN</name>
              <description>SYSCFG bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: SYSCFG bus clock disabled in Sleep mode
- 1: SYSCFG bus clock enabled in Sleep mode (if enabled in SYSCFGEN)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSMEN</name>
              <description>LCDC bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: LCDC bus clock disabled in Sleep mode
- 1: LCDC bus clock enabled in Sleep mode (if enabled in LCDCEN)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPSMEN</name>
              <description>COMP bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: COMP bus clock disabled in Sleep mode
- 1: COMP bus clock enabled in Sleep mode (if enabled in COMPEN)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACSMEN</name>
              <description>DAC bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: DAC bus clock disabled in Sleep mode
- 1: DAC bus clock enabled in Sleep mode (if enabled in DACEN)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCSMEN</name>
              <description>RTC bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: RTC bus clock disabled in Sleep mode
- 1: RTC bus clock enabled in Sleep mode (if enabled in RTCEN)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCSCSMEN</name>
              <description>LCSC bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: LCSC bus clock disabled in Sleep mode
- 1: LCSC bus clock enabled in Sleep mode (if enabled in LCSCEN)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGSMEN</name>
              <description>WDG clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: WDG clock disabled in Sleep mode
- 1: WDG clock enabled in Sleep mode (if enabled in WDGEN)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGMCUSMEN</name>
              <description>DBGMCU clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: DBGMCU clock disabled in Sleep mode
- 1: DBGMCU clock enabled in Sleep mode (if enabled in DBGMCUEN)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1SMENR</name>
          <displayName>APB1SMENR</displayName>
          <description>APB1SMENR register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00A04511</resetValue>
          <fields>
            <field>
              <name>SPI1SMEN</name>
              <description>SPI1 bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: SPI1 bus clock disabled in Sleep mode
- 1: SPI1 bus clock enabled in Sleep mode (if enabled in SPI1EN)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCDIGSMEN</name>
              <description>ADCDIG bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: ADCDIG bus clock disabled in Sleep mode
- 1: ADCDIG bus clock enabled in Sleep mode (if enabled by ADCDIGEN)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUARTSMEN</name>
              <description>LPUART bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: LPUART bus clock disabled in Sleep mode
- 1: LPUART bus clock enabled in Sleep mode (if enabled in LPUARTEN)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USARTSMEN</name>
              <description>USART bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: USART bus clock disabled in Sleep mode
- 1: USART bus clock enabled in Sleep mode (if enabled in USARTEN)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3SMEN</name>
              <description>SPI3 bus clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: SPI3 bus clock disabled in Sleep mode
- 1: SPI3 bus clock enabled in Sleep mode (if enabled in SPI3EN)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1SMEN</name>
              <description>I2C1 clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: I2C1 clock disabled in Sleep mode
- 1: I2C1 clock enabled in Sleep mode (if enabled in I2C1EN)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2SMEN</name>
              <description>I2C2 clock enable during Sleep mode bit
This bit is set and reset by software.
- 0: I2C2 clock disabled in Sleep mode
- 1: I2C2 clock enabled in Sleep mode (if enabled in I2C2EN)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
