KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSTEM_CTRL</name>
      <groupName>SYSTEM_CTRL</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x48</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIE_ID</name>
          <displayName>DIE_ID</displayName>
          <description>DIE_ID register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000120</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Cut revision (metal fix)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VERSION</name>
              <description>Cut version</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODUCT</name>
              <description>Product version.
May be used to discriminate several version of a same digital BLE LPH device embedding
different analog versions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_ID</name>
          <displayName>JTAG_ID</displayName>
          <description>JTAG_ID register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x02027041</resetValue>
          <fields>
            <field>
              <name>MANUF_ID</name>
              <description>Manufacturer ID</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_NUMBER</name>
              <description>Part number</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VERSION_NUMBER</name>
              <description>Version</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_FMP_CTRL</name>
          <displayName>I2C_FMP_CTRL</displayName>
          <description>I2C_FMP_CTRL register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C1_PA0_FMP</name>
              <description>I2C1 Fast-Mode Plus driving capability for I2C1_SCL on PA0 I/O.
0: PA0 pin operated in standard mode.
1: FM+ mode is enabled on PA0 pin, and speed control is bypassed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PA1_FMP</name>
              <description>I2C1 Fast-Mode Plus driving capability for I2C1_SDA on PA1 I/O.
0: PA1 pin operated in standard mode.
1: FM+ mode is enabled on PA1 pin, and speed control is bypassed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PB6_FMP</name>
              <description>I2C1 Fast-Mode Plus driving capability for I2C1_SCL on PB6 I/O.
0: PB6 pin operated in standard mode.
1: FM+ mode is enabled on PB6 pin, and speed control is bypassed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PB7_FMP</name>
              <description>I2C1 Fast-Mode Plus driving capability for I2C1_SDA on PB7 I/O.
0: PB7 pin operated in standard mode.
1: FM+ mode is enabled on PB7 pin, and speed control is bypassed</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PB10_FMP</name>
              <description>I2C1_PB10_FMP: I2C1 Fast-Mode Plus driving capability for I2C1_SDA on PB10 I/O.
0: PB10 pin operated in standard mode.
1: FM+ mode is enabled on PB10 pin, and speed control is bypassed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PB11_FMP</name>
              <description>I2C1_PB11_FMP: I2C1 Fast-Mode Plus driving capability for I2C1_SCL on PB11 I/O.
0: PB11 pin operated in standard mode.
1: FM+ mode is enabled on PB11 pin, and speed control is bypassed</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2_PA6_FMP</name>
              <description>I2C2_PA6_FMP: I2C2 Fast-Mode Plus driving capability for I2C2_SCL on PA6 I/O.
0: PA6 pin operated in standard mode.
1: FM+ mode is enabled on PA6 pin, and speed control is bypassed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2_PA7_FMP</name>
              <description>I2C2_PA7_FMP: I2C2 Fast-Mode Plus driving capability for I2C2_SDA on PA7 I/O.
0: PA7 pin operated in standard mode.
1: FM+ mode is enabled on PA7 pin, and speed control is bypassed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2_PA13_FMP</name>
              <description>I2C2_PA13_FMP: I2C2 Fast-Mode Plus driving capability for I2C2_SCL on PA13 I/O.
0: PA13 pin operated in standard mode.
1: FM+ mode is enabled on PA13 pin, and speed control is bypassed.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2_PA14_FMP</name>
              <description>I2C2_PA14_FMP: I2C2 Fast-Mode Plus driving capability for I2C2_SDA on PA14 I/O.
0: PA14 pin operated in standard mode.
1: FM+ mode is enabled on PA14 pin, and speed control is bypassed.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_DTR</name>
          <displayName>IO_DTR</displayName>
          <description>IO_DTR register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA0_DT</name>
              <description>PA0_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA1_DT</name>
              <description>PA1_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA2_DT</name>
              <description>PA2_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA3_DT</name>
              <description>PA3_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA4_DT</name>
              <description>PA4_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA5_DT</name>
              <description>PA5_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA6_DT</name>
              <description>PA6_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA7_DT</name>
              <description>PA7_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA8_DT</name>
              <description>PA8_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_DT</name>
              <description>PA9_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_DT</name>
              <description>PA10_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_DT</name>
              <description>PA11_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA12_DT</name>
              <description>PA12_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA13_DT</name>
              <description>PA13_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA14_DT</name>
              <description>PA14_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA15_DT</name>
              <description>PA15_DT:      Interrupt Detection Type for port A I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB0_DT</name>
              <description>PB0_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_DT</name>
              <description>PB1_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_DT</name>
              <description>PB2_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_DT</name>
              <description>PB3_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_DT</name>
              <description>PB4_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_DT</name>
              <description>PB5_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_DT</name>
              <description>PB6_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_DT</name>
              <description>PB7_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB8_DT</name>
              <description>PB8_DT:       Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9_DT</name>
              <description>PB9_DT:        Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10_DT</name>
              <description>PB10_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB11_DT</name>
              <description>PB11_DT:        Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_DT</name>
              <description>PB12_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_DT</name>
              <description>PB13_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_DT</name>
              <description>PB14_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_DT</name>
              <description>PB15_DT:      Interrupt Detection Type for port B I/Os.
0: edge detection.
1: level detection.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
