KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL33.svd
        <register>
          <name>INTAI_IER</name>
          <displayName>INTAI_IER</displayName>
          <description>INTAI_IER register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>TX_IE</name>
              <description>TX_IE: interrupt enable on TX_SEQUENCE signal:
0: TX_SEQUENCE interrupt is disabled (default).
1: TX_SEQUENCE interrupt is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_IE</name>
              <description>RX_IE: interrupt enable on RX_SEQUENCE signal:
0: RX_SEQUENCE interrupt is disabled (default).
1: RX_SEQUENCE interrupt is enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_IE</name>
              <description>COMP_IE: interrupt enable on COMP_OUT signal:
0: COMP_OUT interrupt is disabled (default).
1: COMP_OUT interrupt is enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIP_BUSY_STATUS_IE</name>
              <description>RFIP_BUSY_STATUS_IE: interrupt enable on RFIP_BUSY_STATUS signal:
0: RFIP_BUSY_STATUS interrupt is disabled (default).
1: RFIP_BUSY_STATUS interrupt is enabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTAI_ISCR</name>
          <displayName>INTAI_ISCR</displayName>
          <description>INTAI_ISCR register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>TX_ISC</name>
              <description>TX_ISC:interrupt status on TX_SEQUENCE signal (can be a rising or a falling edge
depending on BLERXTX_IEVR and BLERXTX_IBER):
0: no activity on TX_SEQUENCE detected.
1: activity on TX_SEQUENCE occurred</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ISC</name>
              <description>RX_ISC: interrupt status on RX_SEQUENCE signal (can be a rising or a falling edge
depending on BLERXTX_IEVR and BLERXTX_IBER):
0: no activity on RX_SEQUENCE detected.
1: activity on RX_SEQUENCE occurred</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ISEDGE</name>
              <description>TX_ISEDGE: interrupt edge status on TX_SEQUENCE signal:
0: falling edge on TX_SEQUENCE detected.
1: rising edge on TX_SEQUENCE detected.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_ISEDGE</name>
              <description>RX_ISEDGE: interrupt edge status on RX_SEQUENCE signal:
0: falling edge on RX_SEQUENCE detected.
1: rising edge on RX_SEQUENCE detected.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_ISC</name>
              <description>COMP_ISC: interrupt status on COMP_OUT (can be a rising or a falling edge depending on
INTAI_IEVR and INTAI_IBER):
0: no activity on COMP_OUT detected.
1: activity on COMP_OUT occurred</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIP_BUSY_STATUS_ISC</name>
              <description>RFIP_BUSY_STATUS_ISC: interrupt status on RFIP_BUSY_STATUS (can be a rising or a
falling edge depending on INTAI_IEVR and INTAI_IBER):
0: no activity on RFIP_BUSY_STATUS detected.
1: activity on RFIP_BUSY_STATUS occurred</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_SR1</name>
          <displayName>SYSCFG_SR1</displayName>
          <description>SYSCFG_SR1 register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>RFIP_BUSY_STATUS</name>
              <description>RFIP_BUSY_STATUS: MR_SUBG BUSY status:
Software should check that MR_SUBG IP is not busy (or relay on the related interrupt) before
to initiate any system clock frequency switch to operate the switching in a safe way.
0: MR_SUBG is not busy.
1: MR_SUBG is busy</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DTB_CONFIG</name>
          <displayName>RF_DTB_CONFIG</displayName>
          <description>RF_DTB_CONFIG register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>RF_DTB_CONFIG</name>
              <description>Controlling AF7 extended mode:
- 00 : MR_SUBG DTB default configuration
- 01 : MR_SUBG DTB shuffled configuration
- 10 : BUBBLE_DTB configuration
- 11 : MR_SUBG DTB default configuration (as per 00)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
